Revit 2027 API
ParameterTypeId.FabricParamLocationGeneric Property
 "Location": Fabric location in the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricParamLocationGeneric { get; }
Public Shared ReadOnly Property FabricParamLocationGeneric As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricParamLocationGeneric {
	ForgeTypeId^ get ();
}
static member FabricParamLocationGeneric : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace